#### App Infra Plan ✅ success
<details><summary>Show Plan</summary>

```terraform
module.alb.tls_private_key.self_signed: Refreshing state... [id=7ca5e97edcaae27a6345cfb1079f2d7ff55280e2]
module.alb.tls_self_signed_cert.self_signed: Refreshing state... [id=68070148414163896828317660333147827354]
data.aws_iam_role.task_execution: Reading...
module.codedeploy.aws_iam_role.codedeploy: Refreshing state... [id=streaver-ch-codedeploy]
module.codedeploy.aws_codedeploy_app.main: Refreshing state... [id=674891c4-05d3-4dc7-844f-87efff9fafe7:streaver-ch-hello-world]
module.alerting.data.aws_region.current: Reading...
module.workload.aws_service_discovery_http_namespace.main: Refreshing state... [id=ns-v4rdsl32fjyvaan2]
module.logging.aws_iam_role.cwl_to_firehose: Refreshing state... [id=streaver-ch-cwl-to-firehose]
module.workload.aws_iam_role.task: Refreshing state... [id=streaver-ch-hello-world-task]
module.logging.aws_iam_role.firehose: Refreshing state... [id=streaver-ch-firehose-logs]
module.dns.aws_route53_zone.main: Refreshing state... [id=Z038933932YEINJUO9MM1]
module.alerting.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.alerting.data.aws_caller_identity.current: Reading...
module.alerting.data.aws_caller_identity.current: Read complete after 0s [id=891510086861]
data.aws_ecs_cluster.main: Reading...
data.aws_iam_role.task_execution: Read complete after 0s [id=streaver-ch-ecs-task-execution]
data.aws_vpc.public: Reading...
module.workload.aws_cloudwatch_log_group.main: Refreshing state... [id=/ecs/streaver-ch/hello-world]
data.aws_ecs_cluster.main: Read complete after 0s [id=arn:aws:ecs:us-east-1:891510086861:cluster/streaver-ch-cluster]
module.alb.aws_acm_certificate.self_signed: Refreshing state... [id=arn:aws:acm:us-east-1:891510086861:certificate/42c9c02a-48e8-4540-bd15-66a9386a81c5]
module.alerting.aws_sns_topic.alarms: Refreshing state... [id=arn:aws:sns:us-east-1:891510086861:streaver-ch-alarms]
module.logging.aws_s3_bucket.logs: Refreshing state... [id=streaver-ch-logs]
data.aws_vpc.private: Reading...
module.monitoring.data.aws_region.current: Reading...
module.monitoring.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.workload.data.aws_region.current: Reading...
module.workload.data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_ecr_repository.hello_world: Reading...
module.codedeploy.aws_iam_role_policy_attachment.codedeploy_ecs: Refreshing state... [id=streaver-ch-codedeploy/arn:aws:iam::aws:policy/AWSCodeDeployRoleForECS]
module.workload.aws_iam_role_policy.task_cloudwatch: Refreshing state... [id=streaver-ch-hello-world-task:streaver-ch-hello-world-task-cloudwatch]
module.alerting.aws_sns_topic_policy.eventbridge: Refreshing state... [id=arn:aws:sns:us-east-1:891510086861:streaver-ch-alarms]
module.alerting.aws_sns_topic_subscription.email: Refreshing state... [id=arn:aws:sns:us-east-1:891510086861:streaver-ch-alarms:0eac4a6f-2e35-46b0-8491-a2aa1fe41993]
module.waf.aws_wafv2_web_acl.main: Refreshing state... [id=83eea5b6-b798-4233-a5a1-28c0ac73c882]
data.aws_ecr_repository.hello_world: Read complete after 1s [id=streaver-ch/hello-world]
module.workload.aws_ecs_task_definition.main: Refreshing state... [id=streaver-ch-hello-world]
data.aws_vpc.public: Read complete after 1s [id=vpc-041898227fc036c59]
data.aws_subnets.public: Reading...
module.alb.aws_security_group.alb: Refreshing state... [id=sg-0ce364d5eeb0a61e0]
module.alb.aws_lb_target_group.green: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:891510086861:targetgroup/streaver-ch-green/b23d0851bbd5f38b]
module.alb.aws_lb_target_group.blue: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:891510086861:targetgroup/streaver-ch-blue/6ec27f32cbd5f747]
data.aws_vpc.private: Read complete after 1s [id=vpc-01f1ec58abd8f6ab2]
data.aws_subnets.private: Reading...
module.workload.aws_security_group.main: Refreshing state... [id=sg-0a0cb40905d6f23fc]
data.aws_subnets.public: Read complete after 1s [id=us-east-1]
module.alb.aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:891510086861:loadbalancer/app/streaver-ch-alb/4e280dc223a26598]
data.aws_subnets.private: Read complete after 1s [id=us-east-1]
module.logging.aws_s3_bucket_public_access_block.logs: Refreshing state... [id=streaver-ch-logs]
module.logging.aws_iam_role_policy.firehose_s3: Refreshing state... [id=streaver-ch-firehose-logs:streaver-ch-firehose-s3]
module.logging.aws_s3_bucket_server_side_encryption_configuration.logs: Refreshing state... [id=streaver-ch-logs]
module.logging.aws_s3_bucket_lifecycle_configuration.logs: Refreshing state... [id=streaver-ch-logs]
module.logging.aws_kinesis_firehose_delivery_stream.logs["hello-world"]: Refreshing state... [id=arn:aws:firehose:us-east-1:891510086861:deliverystream/streaver-ch-hello-world]
module.dns.aws_route53_record.alb: Refreshing state... [id=Z038933932YEINJUO9MM1_grobert-streaver.com_A]
module.logging.aws_iam_role_policy.cwl_firehose: Refreshing state... [id=streaver-ch-cwl-to-firehose:streaver-ch-cwl-firehose]
module.logging.aws_cloudwatch_log_subscription_filter.logs["hello-world"]: Refreshing state... [id=cwlsf-2306601927]
module.waf.aws_wafv2_web_acl_association.alb: Refreshing state... [id=arn:aws:wafv2:us-east-1:891510086861:regional/webacl/streaver-ch-waf/83eea5b6-b798-4233-a5a1-28c0ac73c882,arn:aws:elasticloadbalancing:us-east-1:891510086861:loadbalancer/app/streaver-ch-alb/4e280dc223a26598]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.alb.aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = "arn:aws:acm:us-east-1:891510086861:certificate/42c9c02a-48e8-4540-bd15-66a9386a81c5"
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = "arn:aws:elasticloadbalancing:us-east-1:891510086861:loadbalancer/app/streaver-ch-alb/4e280dc223a26598"
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + region                                                                = "us-east-1"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-2021-06"
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.alb.aws_lb_target_group.blue must be replaced
-/+ resource "aws_lb_target_group" "blue" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-1:891510086861:targetgroup/streaver-ch-blue/6ec27f32cbd5f747" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/streaver-ch-blue/6ec27f32cbd5f747" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-1:891510086861:targetgroup/streaver-ch-blue/6ec27f32cbd5f747" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancer_arns                 = [] -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_anomaly_mitigation  = "off" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "streaver-ch-blue"
      + name_prefix                        = (known after apply)
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
        tags                               = {
            "Name" = "streaver-ch-blue"
        }
      - target_control_port                = 0 -> null
      ~ vpc_id                             = "vpc-01f1ec58abd8f6ab2" -> "vpc-041898227fc036c59" # forces replacement
        # (9 unchanged attributes hidden)

      ~ stickiness (known after apply)
      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
            # (1 unchanged attribute hidden)
        }

      ~ target_failover (known after apply)
      - target_failover {}

      ~ target_group_health (known after apply)
      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      ~ target_health_state (known after apply)
      - target_health_state {}

        # (1 unchanged block hidden)
    }

  # module.alb.aws_lb_target_group.green must be replaced
-/+ resource "aws_lb_target_group" "green" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-1:891510086861:targetgroup/streaver-ch-green/b23d0851bbd5f38b" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/streaver-ch-green/b23d0851bbd5f38b" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-1:891510086861:targetgroup/streaver-ch-green/b23d0851bbd5f38b" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancer_arns                 = [] -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_anomaly_mitigation  = "off" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "streaver-ch-green"
      + name_prefix                        = (known after apply)
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
        tags                               = {
            "Name" = "streaver-ch-green"
        }
      - target_control_port                = 0 -> null
      ~ vpc_id                             = "vpc-01f1ec58abd8f6ab2" -> "vpc-041898227fc036c59" # forces replacement
        # (9 unchanged attributes hidden)

      ~ stickiness (known after apply)
      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
            # (1 unchanged attribute hidden)
        }

      ~ target_failover (known after apply)
      - target_failover {}

      ~ target_group_health (known after apply)
      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      ~ target_health_state (known after apply)
      - target_health_state {}

        # (1 unchanged block hidden)
    }

  # module.alerting.aws_cloudwatch_event_rule.circuit_breaker["hello-world"] will be created
  + resource "aws_cloudwatch_event_rule" "circuit_breaker" {
      + arn            = (known after apply)
      + description    = "Fires when the ECS deployment circuit breaker rolls back hello-world."
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + eventName = [
                      + "SERVICE_DEPLOYMENT_FAILED",
                    ]
                  + reason    = [
                      + {
                          + prefix = "ECS deployment circuit breaker"
                        },
                    ]
                }
              + detail-type = [
                  + "ECS Deployment State Change",
                ]
              + resources   = [
                  + "arn:aws:ecs:us-east-1:891510086861:service/streaver-ch-cluster/streaver-ch-hello-world",
                ]
              + source      = [
                  + "aws.ecs",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "streaver-ch-hello-world-circuit-breaker"
      + name_prefix    = (known after apply)
      + region         = "us-east-1"
      + tags           = {
          + "Name" = "streaver-ch-hello-world-circuit-breaker"
        }
      + tags_all       = {
          + "Name" = "streaver-ch-hello-world-circuit-breaker"
        }
    }

  # module.alerting.aws_cloudwatch_event_target.circuit_breaker["hello-world"] will be created
  + resource "aws_cloudwatch_event_target" "circuit_breaker" {
      + arn            = "arn:aws:sns:us-east-1:891510086861:streaver-ch-alarms"
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "us-east-1"
      + rule           = "streaver-ch-hello-world-circuit-breaker"
      + target_id      = (known after apply)
    }

  # module.alerting.aws_cloudwatch_metric_alarm.alb_5xx["hello-world"] will be created
  + resource "aws_cloudwatch_metric_alarm" "alb_5xx" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:891510086861:streaver-ch-alarms",
        ]
      + alarm_description                     = "ALB 5XX errors for hello-world exceeded 10 in a 5-minute window."
      + alarm_name                            = "streaver-ch-hello-world-alb-5xx"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "HTTPCode_Target_5XX_Count"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:891510086861:streaver-ch-alarms",
        ]
      + period                                = 300
      + region                                = "us-east-1"
      + statistic                             = "Sum"
      + tags                                  = {
          + "Name" = "streaver-ch-hello-world-alb-5xx"
        }
      + tags_all                              = {
          + "Name" = "streaver-ch-hello-world-alb-5xx"
        }
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }

  # module.alerting.aws_cloudwatch_metric_alarm.alb_response_time["hello-world"] will be created
  + resource "aws_cloudwatch_metric_alarm" "alb_response_time" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:891510086861:streaver-ch-alarms",
        ]
      + alarm_description                     = "ALB p99 response time for hello-world exceeded 2 seconds."
      + alarm_name                            = "streaver-ch-hello-world-alb-response-time"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + extended_statistic                    = "p99"
      + id                                    = (known after apply)
      + metric_name                           = "TargetResponseTime"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:891510086861:streaver-ch-alarms",
        ]
      + period                                = 300
      + region                                = "us-east-1"
      + tags                                  = {
          + "Name" = "streaver-ch-hello-world-alb-response-time"
        }
      + tags_all                              = {
          + "Name" = "streaver-ch-hello-world-alb-response-time"
        }
      + threshold                             = 2
      + treat_missing_data                    = "notBreaching"
    }

  # module.alerting.aws_cloudwatch_metric_alarm.alb_unhealthy_hosts["hello-world"] will be created
  + resource "aws_cloudwatch_metric_alarm" "alb_unhealthy_hosts" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:891510086861:streaver-ch-alarms",
        ]
      + alarm_description                     = "One or more ALB targets for hello-world are unhealthy."
      + alarm_name                            = "streaver-ch-hello-world-alb-unhealthy-hosts"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "UnHealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:891510086861:streaver-ch-alarms",
        ]
      + period                                = 60
      + region                                = "us-east-1"
      + statistic                             = "Maximum"
      + tags                                  = {
          + "Name" = "streaver-ch-hello-world-alb-unhealthy-hosts"
        }
      + tags_all                              = {
          + "Name" = "streaver-ch-hello-world-alb-unhealthy-hosts"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.alerting.aws_cloudwatch_metric_alarm.ecs_cpu_high["hello-world"] will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_cpu_high" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:891510086861:streaver-ch-alarms",
        ]
      + alarm_description                     = "ECS CPU utilization for hello-world exceeded 80% for 10 minutes."
      + alarm_name                            = "streaver-ch-hello-world-ecs-cpu-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "streaver-ch-cluster"
          + "ServiceName" = "streaver-ch-hello-world"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:891510086861:streaver-ch-alarms",
        ]
      + period                                = 300
      + region                                = "us-east-1"
      + statistic                             = "Average"
      + tags                                  = {
          + "Name" = "streaver-ch-hello-world-ecs-cpu-high"
        }
      + tags_all                              = {
          + "Name" = "streaver-ch-hello-world-ecs-cpu-high"
        }
      + threshold                             = 80
      + treat_missing_data                    = "notBreaching"
    }

  # module.alerting.aws_cloudwatch_metric_alarm.ecs_memory_high["hello-world"] will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_memory_high" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:891510086861:streaver-ch-alarms",
        ]
      + alarm_description                     = "ECS memory utilization for hello-world exceeded 80% for 10 minutes."
      + alarm_name                            = "streaver-ch-hello-world-ecs-memory-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "streaver-ch-cluster"
          + "ServiceName" = "streaver-ch-hello-world"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:891510086861:streaver-ch-alarms",
        ]
      + period                                = 300
      + region                                = "us-east-1"
      + statistic                             = "Average"
      + tags                                  = {
          + "Name" = "streaver-ch-hello-world-ecs-memory-high"
        }
      + tags_all                              = {
          + "Name" = "streaver-ch-hello-world-ecs-memory-high"
        }
      + threshold                             = 80
      + treat_missing_data                    = "notBreaching"
    }

  # module.codedeploy.aws_codedeploy_deployment_group.main will be created
  + resource "aws_codedeploy_deployment_group" "main" {
      + app_name                    = "streaver-ch-hello-world"
      + arn                         = (known after apply)
      + compute_platform            = (known after apply)
      + deployment_config_name      = "CodeDeployDefault.ECSCanary10Percent5Minutes"
      + deployment_group_id         = (known after apply)
      + deployment_group_name       = "streaver-ch-hello-world"
      + id                          = (known after apply)
      + outdated_instances_strategy = "UPDATE"
      + region                      = "us-east-1"
      + service_role_arn            = "arn:aws:iam::891510086861:role/streaver-ch-codedeploy"
      + tags                        = {
          + "Name" = "streaver-ch-hello-world"
        }
      + tags_all                    = {
          + "Name" = "streaver-ch-hello-world"
        }
      + termination_hook_enabled    = false

      + alarm_configuration {
          + alarms                    = [
              + "streaver-ch-hello-world-alb-5xx",
              + "streaver-ch-hello-world-alb-unhealthy-hosts",
            ]
          + enabled                   = true
          + ignore_poll_alarm_failure = false
        }

      + auto_rollback_configuration {
          + enabled = true
          + events  = [
              + "DEPLOYMENT_FAILURE",
              + "DEPLOYMENT_STOP_ON_ALARM",
            ]
        }

      + blue_green_deployment_config {
          + deployment_ready_option {
              + action_on_timeout = "CONTINUE_DEPLOYMENT"
            }
          + green_fleet_provisioning_option (known after apply)
          + terminate_blue_instances_on_deployment_success {
              + action                           = "TERMINATE"
              + termination_wait_time_in_minutes = 5
            }
        }

      + deployment_style {
          + deployment_option = "WITH_TRAFFIC_CONTROL"
          + deployment_type   = "BLUE_GREEN"
        }

      + ecs_service {
          + cluster_name = "streaver-ch-cluster"
          + service_name = "streaver-ch-hello-world"
        }

      + load_balancer_info {
          + target_group_pair_info {
              + prod_traffic_route {
                  + listener_arns = (known after apply)
                }
              + target_group {
                  + name = "streaver-ch-blue"
                }
              + target_group {
                  + name = "streaver-ch-green"
                }
            }
        }
    }

  # module.monitoring.aws_cloudwatch_dashboard.main will be created
  + resource "aws_cloudwatch_dashboard" "main" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = (known after apply)
      + dashboard_name = "streaver-ch-dashboard"
      + id             = (known after apply)
      + region         = "us-east-1"
    }

  # module.workload.aws_appautoscaling_policy.cpu will be created
  + resource "aws_appautoscaling_policy" "cpu" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "streaver-ch-hello-world-cpu"
      + policy_type        = "TargetTrackingScaling"
      + region             = "us-east-1"
      + resource_id        = "service/streaver-ch-cluster/streaver-ch-hello-world"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 60

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.workload.aws_appautoscaling_policy.memory will be created
  + resource "aws_appautoscaling_policy" "memory" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "streaver-ch-hello-world-memory"
      + policy_type        = "TargetTrackingScaling"
      + region             = "us-east-1"
      + resource_id        = "service/streaver-ch-cluster/streaver-ch-hello-world"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 70

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.workload.aws_appautoscaling_policy.requests will be created
  + resource "aws_appautoscaling_policy" "requests" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "streaver-ch-hello-world-requests"
      + policy_type        = "TargetTrackingScaling"
      + region             = "us-east-1"
      + resource_id        = "service/streaver-ch-cluster/streaver-ch-hello-world"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 1000

          + predefined_metric_specification {
              + predefined_metric_type = "ALBRequestCountPerTarget"
              + resource_label         = (known after apply)
            }
        }
    }

  # module.workload.aws_appautoscaling_target.main will be created
  + resource "aws_appautoscaling_target" "main" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 4
      + min_capacity       = 1
      + region             = "us-east-1"
      + resource_id        = "service/streaver-ch-cluster/streaver-ch-hello-world"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = (known after apply)

      + suspended_state (known after apply)
    }

  # module.workload.aws_ecs_service.main will be created
  + resource "aws_ecs_service" "main" {
      + arn                                = (known after apply)
      + availability_zone_rebalancing      = (known after apply)
      + cluster                            = "streaver-ch-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "streaver-ch-hello-world"
      + platform_version                   = (known after apply)
      + region                             = "us-east-1"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name" = "streaver-ch-hello-world"
        }
      + tags_all                           = {
          + "Name" = "streaver-ch-hello-world"
        }
      + task_definition                    = "arn:aws:ecs:us-east-1:891510086861:task-definition/streaver-ch-hello-world:3"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 1
        }

      + deployment_configuration (known after apply)

      + deployment_controller {
          + type = "CODE_DEPLOY"
        }

      + load_balancer {
          + container_name   = "hello-world"
          + container_port   = 8000
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0a0cb40905d6f23fc",
            ]
          + subnets          = [
              + "subnet-00ba1e580fb4c3261",
              + "subnet-04f16eafbdb67c824",
              + "subnet-0931f209edbd1809c",
            ]
        }
    }

  # module.workload.aws_service_discovery_http_namespace.main will be destroyed
  # (because aws_service_discovery_http_namespace.main is not in configuration)
  - resource "aws_service_discovery_http_namespace" "main" {
      - arn         = "arn:aws:servicediscovery:us-east-1:891510086861:namespace/ns-v4rdsl32fjyvaan2" -> null
      - http_name   = "streaver-ch-hello-world" -> null
      - id          = "ns-v4rdsl32fjyvaan2" -> null
      - name        = "streaver-ch-hello-world" -> null
      - region      = "us-east-1" -> null
      - tags        = {
          - "Name" = "streaver-ch-hello-world"
        } -> null
      - tags_all    = {
          - "Name" = "streaver-ch-hello-world"
        } -> null
        # (1 unchanged attribute hidden)
    }

Plan: 17 to add, 0 to change, 3 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "image_tag_stable" but a
value was found in file "terraform.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Value for undeclared variable

The root module does not declare a variable named "image_tag_canary" but a
value was found in file "terraform.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Values for undeclared variables

In addition to the other similar warnings shown, 2 other variable(s) defined
without being declared.

Warning: Deprecated attribute

  on monitoring/dashboard.tf line 28, in resource "aws_cloudwatch_dashboard" "main":
  28:           region = data.aws_region.current.name

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 6 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>